{
    "projects" : [
        {
            "title": "Machine Learning Predicitve Models",
            "bodyText": "- Led a team to design and implement machine learning models to predict NBA game outcomes, leveraging Python for data preprocessing, analysis, and model development.\n - Developed and compared multiple machine learning algorithms, including SVM, Random Forest, and Logistic Regression, achieving accurate predictions based on PCA components.\n - Optimized model performance by conducting hyperparameter tuning and evaluating metrics such as accuracy, F1-score, and ROC-AUC to refine predictions and ensure robust results.",
            "links": [
                {
                    "text": "Website",
                    "href": "https://endeavored.github.io/cs4641/"
                }
            ],
            "tags" : [
                "Python",
                "Data Analysis",
                "scikit-learn",
                "NumPy",
                "Pandas"
            ]
        },
        {
            "title": "OptiDrop Eyedropper for Glaucoma Patients",
            "bodyText": "- Conducted user research with 25 glaucoma patients and 4 ophthalmologists to identify key user challenges.\n - Developed a track-based alignment system and air-pressure dispensing mechanism using mechanical design and prototyping skills to ensure precise and efficient single-drop application.\n - Applied user-centered design principles by integrating feedback from patient testing to refine usability, ensuring the device was lightweight, affordable, and compatible with a wide range of bottle types.",
            "links": [
                {
                    "text": "Website",
                    "href": "https://cjalenj.github.io/OptiDrop/"
                }
            ],
            "tags" : [
                "User Interviews",
                "Prototyping",
                "User-Centered Design",
                "Market Research",
                "HTML",
                "CSS"
            ]
        },
        {
            "title": "Dungeon Crawler Game",
            "bodyText": "- Led the development of a dungeon crawler game using Android Studios, showcasing teamwork and project coordination.\n - Implemented JUnit testing for robust code quality, ensuring the reliability and stability of the game's features.\n - Utilized Git for effective code version control and organization, streamlining collaboration among team members.\n - Integrated Android libraries in Java and XML to design a captivating UI that enhanced the overall gaming experience.",
            "tags" : [
                "Java",
                "XML",
                "Android Studio",
                "Git",
                "Agile",
                "Scrum"
            ]
        },
        {
            "title": "Restaurant Management Application",
            "bodyText": "- Developed a JavaFX user interface application to organize ingredient data, calculating and presenting total costs for various recipes in a structured format for a restaurant management client.\n - Created a second version using PowerShell, WPF, and XAML, showcasing proficiency in different technologies and expanding the accessibility and ease of use of the program.",
            "tags" : [
                "JavaFX",
                "User Interface Design",
                "XAML",
                "WPF",
                "PowerShell"
            ]
        },
        {
            "title": "Productivity Application",
            "bodyText": "- Developed a JavaFX-based To-Do List Applet, streamlining task, appointment, and homework management.\n - Integrated a reminder system for timely notifications, enhancing user productivity.\n - Created a Pomodoro Timer using JavaFX, allowing users to customize interval amounts for efficient time management.\n - Designed an intuitive user interface, providing a seamless experience for users to personalize their work and break sessions.",
            "tags" : [
                "JavaFX",
                "User Interface Design"
            ]
        }
    ]
}